## Homebrew applications ##

# Utilities bundles
brew 'coreutils'		# GNU Coreutils
brew 'moreutils'		# Missing Coreutils
brew 'dockutil'			# Manage dock from CLI

# Essential
brew 'zsh'			# Better shell
brew 'vim'			# Update to Vim8

# Missing Utilities
brew 'p7zip'			# Unzip weird stuff
brew 'curl'
brew 'wget'
brew 'tree'			# Tree view for folder content
brew 'grep', args: ['with-default-names']
brew 'jo'			# JSON output from CLI
brew 'jq'			# CLI JSON processor

# Developer tools
brew 'git'			# Git
brew 'hub'			# Github flavoured Git
brew 'icdiff'			# Improved colored diff
brew 'iproute2mac'		# Run "ip addr show" on mac
brew 'progress'			# Show progress for cp, mv, dd, ..
brew 'git-standup'		# Better git log, multiple repo support
brew 'the_silver_searcher'	# Code searching tool, like grep

# MacAppStore
brew 'mas'			# CLI version of Mac App Store

## Cask applications ##

cask_args appdir: '/Applications'

# Terminal
cask 'iterm2'			# Replacement terminal with shell integration

# Browsers
cask 'firefox'
cask 'google-chrome'

# Communications
cask 'slack'			# Team chats
cask 'skype'			# Online video calls, chat
cask 'signal'			# Encrypted communications

# Media
# cask 'soundcleod'		# Soundcloud desktop application

# Utilities
cask 'alfred'			# Little helper all around
cask 'bartender'		# Menu bar helper
cask 'gpg-suite'		# Encryption
cask 'appcleaner'		# Application remover
# cask 'etcher'			# Writing images to USB and SD cards
# cask 'keycastr'		# Screencasting key presses
# cask 'numi'			# Text calculator
# cask 'little-snitch'		# Application Firewall
# cask 'tunnelblick'		# VPN software

# Developer Tools
cask 'atom'			# Gegeral IDE
# cask 'arduino'		# Aruduino IDE

# 3D Printing / Designer
# cask 'ultimaker-cura'

## Fonts

cask "caskroom/fonts/font-hack-nerd-font"

## MacAppStore ##

# E-mail
mas 'Airmail 3',	id: 918858936		# Preferred email client

# Utilities
mas 'Next Meeting',	id: 1017470484		# Display next calendar meeting in menu bar
mas 'HazeOver',		id: 430798174		# Helps to focus on app
# mas '1Password', 	id: 443987910		# 1Password 6 from AppStore
# mas 'Daisydisk',	id: 411643860		# See how you use space on your harddrives

# Office alternative
# mas 'Pages',		id: 409201541
# mas 'Numbers',	id: 409203825
# mas 'Keynote',	id: 409183694

# Developer Tools
# mas 'XCode',		id: 497799835
