## Homebrew applications ##

# Utilities bundles
brew 'coreutils'		# GNU Coreutils
brew 'moreutils'		# Missing Coreutils
brew 'dockutil'			# Manage dock from CLI

# Essential
brew 'zsh'			# Better shell
brew 'tmux'			# Terminal Multiplexer
brew 'git'			# Version Control
brew 'hub'			# Github flavoured Git
brew 'vim'			# Update to Vim8

# Missing Utilities
brew 'p7zip'			# Unzip weird stuff
brew 'curl'
brew 'wget'
brew 'tree'			# Tree view for folder content
brew 'grep', args: ['with-default-names']
brew 'jo'			# JSON output from CLI
brew 'jq'			# CLI JSON processor
# brew 'htop'
brew 'pandoc'			# Creating PDF from Markdown
brew 'qrencode'			# Creating QR codes
brew 'todo-txt'			# Todo management in text format

# Gimmicks
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'	# Code searching tool
brew 'markdown'			# Markdown support
brew 'ponysay'			# Better than cowsay

# Developer tools
brew 'ansible'
brew 'asciinema'

# MacAppStore
brew 'mas'			# CLI version of Mac App Store 

## Cask applications ##

cask_args appdir: '/Applications'

# Terminal
cask 'iterm2'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Communications
cask 'slack'
cask 'skype'
cask 'caprine'
cask 'rocket-chat'

# Media
cask 'soundcleod'		# Soundcloud desktop application

# Utilities
cask 'alfred'			# Little helper all around
cask 'spectacle'		# Move and resize windows
cask 'etcher'			# Writing images to USB and SD cards
cask 'keycastr'			# Screencasting key presses
cask 'bartender'		# Menu bar helper
cask 'numi'			# Text calculator
cask 'little-snitch'		# Application Firewall
cask 'appcleaner'		# Application remover
cask 'gpg-suite'		# Encryption
cask 'macdown'			# Markdown App
cask 'mactex'			# LaTeX
cask 'tunnelblick'		# VPN software

# Developer Tools
cask 'atom'			# Gegeral IDE
cask 'arduino'			# Aruduino IDE

# cask 'vagrant'
# cask 'docker'

# cask 'virtualbox'
# cask 'virtualbox-extension-pack'

# cask 'vmware-remote-console'

## Fonts

cask "caskroom/fonts/font-hack-nerd-font"

## MacAppStore ##

# E-mail
mas 'Airmail 3',	id: 918858936

# Office alternative
mas 'Pages',		id: 409201541
mas 'Numbers',		id: 409203825
mas 'Keynote',		id: 409183694

# Utilities
mas '1Password', 	id: 443987910
mas 'Next Meeting',	id: 1017470484
mas 'Daisydisk',	id: 411643860
mas 'Amphetamine',	id: 937984704
mas 'Magnet',		id: 441258766
mas 'HazeOver',		id: 430798174
mas 'The Unarchiver',	id: 425424353

# Developer Tools
mas 'XCode',		id: 497799835
# mas "Microsoft Remote Desktop",	id: 1295203466
