## Homebrew applications ##

# Utilities bundles
brew 'coreutils'		# GNU Coreutils
brew 'moreutils'		# Missing Coreutils
brew 'dockutil'			# Manage dock from CLI

# Essential
brew 'zsh'			# Better shell
brew 'tmux'			# Terminal Multiplexer
brew 'vim'			# Update to Vim8

# Missing Utilities
brew 'p7zip'			# Unzip weird stuff
brew 'curl'
brew 'wget'
brew 'tree'			# Tree view for folder content
brew 'grep', args: ['with-default-names']
brew 'jo'			# JSON output from CLI
brew 'jq'			# CLI JSON processor
brew 'pandoc'			# Creating PDF from Markdown
brew 'todo-txt'			# Todo management in text format
# brew 'htop'
# brew 'qrencode'			# Creating QR codes

# Developer tools
brew 'git'			# Git
brew 'hub'			# Github flavoured Git
brew 'icdiff'			# Improved colored diff
brew 'iproute2mac'		# Run "ip addr show" on mac
brew 'progress'			# Show progress for cp, mv, dd, ..
brew 'git-standup'		# Better git log, multiple repo support
brew 'ansible'			# App deployment, configuration management and orchestration 
# brew 'aria2'			# Multi-protocol & multi-source command-line download utility
# brew 'docker'			# Container platform
# brew 'asciinema'		# Commandline as a presentation or tutorial

# Gimmicks
brew 'markdown'			# Markdown support
brew 'ponysay'			# Better than cowsay
brew 'the_silver_searcher'	# Code searching tool, like grep

# MacAppStore
brew 'mas'			# CLI version of Mac App Store 

## Cask applications ##

cask_args appdir: '/Applications'

# Terminal
cask 'iterm2'			# Replacement terminal with shell integration

# Browsers
cask 'firefox'
cask 'google-chrome'

# Communications
cask 'slack'			# Team chats
cask 'skype'			# Online video calls, chat
cask 'signal'			# Encrypted communications
# cask 'rocket-chat'		# Open source slack alternative
# cask 'caprine'		# App for FB messenger

# Media
cask 'soundcleod'		# Soundcloud desktop application

# Utilities
cask 'alfred'			# Little helper all around
cask 'spectacle'		# Move and resize windows
cask 'etcher'			# Writing images to USB and SD cards
cask 'keycastr'			# Screencasting key presses
cask 'bartender'		# Menu bar helper
cask 'numi'			# Text calculator
cask 'little-snitch'		# Application Firewall
cask 'appcleaner'		# Application remover
cask 'gpg-suite'		# Encryption
cask 'tunnelblick'		# VPN software
# cask 'macdown'			# Markdown App
# cask 'mactex'			# LaTeX

# Developer Tools
cask 'atom'			# Gegeral IDE
# cask 'arduino'			# Aruduino IDE
# cask 'vagrant'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
# cask 'vmware-remote-console'

# 3D Printing / Designer
# cask 'ultimaker-cura'

## Fonts

cask "caskroom/fonts/font-hack-nerd-font"

## MacAppStore ##

# E-mail
mas 'Airmail 3',	id: 918858936

# Utilities
mas '1Password', 	id: 443987910
mas 'Next Meeting',	id: 1017470484
mas 'Magnet',		id: 441258766
mas 'HazeOver',		id: 430798174
mas 'The Unarchiver',	id: 425424353
# mas 'Daisydisk',	id: 411643860
# mas 'Amphetamine',	id: 937984704

# Office alternative
# mas 'Pages',		id: 409201541
# mas 'Numbers',		id: 409203825
# mas 'Keynote',		id: 409183694

# Developer Tools
mas 'XCode',		id: 497799835
# mas "Microsoft Remote Desktop",	id: 1295203466
